{
    "Author": "Mark Winch",
    "Date": "2025-09-14",
    "Title": "AI Dungeon 2",
    "ImagePath": "assets/games/aidungeon.png",
    "Excerpt": "A blend between storytelling and imagination.",
    "ReviewScore": 7,
    "Paragraph": [
        "AI Dungeon isn’t really a game. It’s more like a mix between an interactive story and a collaborative writing tool where you create adventures with an AI. There’s no clear goal or ending, just the freedom to imagine and explore any world you want.",
        "In my time with it, I had an adventure set in the Dragon Age universe, between Inquisition and Veilguard, where my Warden sacrificed themself to stop a Darkspawn threat. In another story, I became an agent of the Void. Both stories felt surprisingly personal, and that’s what makes AI Dungeon special — it adapts to your creativity and ideas.",
        "The main issue is that over time, many community scenarios have shifted toward NSFW content. It makes it harder to find quality stories when you only want to experience original adventures or fantasy settings. Setting up the LLMs and choosing the right one can also be a bit tedious.",
        "Another small drawback is the story card system, which helps the AI remember key facts about your world and characters. Keeping it updated manually can be tedious, and while some people are working on tools that automate this process, they don’t always work well. When it functions properly, though, it really improves consistency and makes your story feel more coherent.",
        "The free tier gives a good idea of what to expect, but it is very limited. After a while, the AI starts forgetting important story details, which can be frustrating when you are deep into a narrative. The Champion tier helps with that, offering better memory and consistency, but it comes at a cost.",
        "I didn’t try the multiplayer mode, but it seems like it could bring interesting possibilities for collaborative storytelling. Even as a solo experience, AI Dungeon remains one of the most creative storytelling tools available, offering endless potential for imagination.",
        "In the end, AI Dungeon is a unique experience that shines when used as a sandbox for creativity. It’s not perfect, but when it works, it can create moments of storytelling magic that few other tools can offer."
    ],
    "GoodSummary": [
        "Unlimited creative freedom",
        "Personal and dynamic storytelling",
        "Interesting world-building potential"
    ],
    "BadSummary": [
        "Too much NSFW community content",
        "Story card management can be cumbersome",
        "Free tier is very limited"
    ]
}
