{
    "Author": "Mark Winch",
    "Date": "2025-10-15",
    "Title": "Sonic Racing CrossWorlds",
    "ImagePath": "assets/games/crossworlds_main.jpg",
    "SecondaryImagePath": "assets/games/crossworlds_second.webp",
    "Excerpt": "A chaotic and fast-paced racing game that is hard to put down.",
    "ReviewScore": 9,
    "Paragraph": [
        "Sonic CrossWorlds Racing is fast, really fast, and it feels incredible to play. I had a hard time putting it down once I started, as the game gets a lot of things right.",
        "Sega introduced a new twist to the Sonic Racing formula with CrossWorlds. You race on the chosen map for the first and final laps, while the second lap takes you to a different one. The leading player can pick between a known track or a random one. This dynamic mechanic adds strategy, especially when you are in first place.",
        "The gameplay feels tight and responsive. It is simple and familiar, yet there is plenty of depth to master if you want to go faster. Even when speeding through tracks, I always feel in control. The transformations from Sonic & All-Stars Racing Transformed return here and fit perfectly. The Grand Prix mode is also improved, letting players retry races with hard-earned tickets if things go wrong.",
        "Customization is plentiful, affecting both performance and appearance. You can mix and match vehicle parts and add patterns to make them your own. The gadget system provides personal modifiers for each driver, letting you tailor your playstyle. For instance, if you prefer an aggressive approach, you can equip gadgets that grant stronger items, and it works beautifully.",
        "Online mode is chaotic and exhilarating, keeping you constantly on edge. Unfortunately, it can also feel unbalanced. Some builds and gadgets are so dominant they are practically mandatory to stay competitive. While not every gadget needs to be equally viable, a few definitely require rebalancing to encourage more diverse setups.",
        "Another concern is the Donpa Tickets. Earning them can feel grindy, especially since so much depends on them. Unlocking new levels in the Friendship system costs thousands of tickets for a single driver level. Considering there are 23 drivers in the base game, anyone aiming for full completion should brace themselves for a long grind.",
        "Finally, the price. Sonic CrossWorlds Racing is not cheap, but if you are a racing fan and plan to play online, it is absolutely worth it. Sega did an excellent job and proved once again they can craft outstanding games. With some fine-tuning to Donpa Tickets and better online balance, this could easily become one of the best arcade racers out there."
    ],
    "GoodSummary": [
        "CrossWorlds are a great addition",
        "A lot of customization options",
        "The gadget system is well made"
    ],
    "BadSummary": [
        "Unbalanced in online",
        "Getting tickets is grindy"
    ]
}
