{
    "Author": "Mark Winch",
    "Date": "2025-04-30",
    "Title": "Clair Obscur: Expedition 33",
    "ImagePath": "assets/games/expedition33_main.jpg",
    "SecondaryImagePath": "assets/games/expedition33_second.jpg",
    "Excerpt": "An unforgettable adventure at a fair price.",
    "ReviewScore": 10,
    "Paragraph": [
        "Clair Obscur: Expedition 33 was not on my radar, but from the moment you open the main menu and the music starts, you know you are about to experience something special. The prologue is one of the best I have ever played, immediately setting the tone and drawing you into the adventure. It’s definitely the first time in my life I teared up after a prologue.",
        "The game combines a rich narrative with immersive gameplay, and every act feels carefully crafted. Characters are engaging and their stories are memorable, giving the game a depth that is rare to find. Combat is well balanced, and the mix of strategy and real-time elements keeps it dynamic and satisfying.",
        "Even though Act 3 is slightly less thight than the earlier acts, it still delivers on the conclusion. The polish throughout the game is exceptional, from visuals to sound design, making every cinematics and battle feel refined.",
        "One of the best surprises is the price. For such a high-quality experience, the game is more affordable than most recent AAA releases, offering incredible value for the exprience.",
        "Overall, Clair Obscur: Expedition 33 is an outstanding adventure. It combines every aspect of game design and polish in a way that few games manage. It instantly became one of my favorites, and it is a must-play for anyone looking for well-crafted experience even if they are not a fan of turn-based combat."
    ],
    "GoodSummary": [
        "Exceptional prologue and world-building",
        "Immersive soundtrack that sets the tone",
        "Engaging characters",
        "Polished gameplay and visuals",
        "Affordable price for quality experience"
    ],
    "BadSummary": [
        "Act 3 slightly is a bit more chaotic than earlier acts"
    ]
}