{
    "Author": "Mark Winch",
    "Date": "2026-01-26",
    "Title": "Return to Office and the Cost for Individuals",
    "ImagePath": "assets/blogs/office.jpg",
    "Excerpt": "The personal cost behind a full return to the office.",
    "Paragraph": [
        "I won't talk about what happening at Ubisoft, because I can't and don't want to. Instead, I’ll focus this blog post on the return to office and why it’s bad news for individuals.",
        "Let’s be honest. Most of the talk around returning to the office feels like a story companies are telling themselves. It sounds clean and reasonable in a company wide message, but when you look at what it actually means for people’s lives, the reality is very different.",
        "Remote work was not just a bonus that appeared during an unusual period. For many of us, it was a practical way to deal with the world as it is. Rent keeps going up. Groceries cost more every year. Transportation is expensive. Working from home gave people back time, reduced daily costs, and offered a bit of control in an environment that already feels tight.",
        "Now that flexibility is being taken away, and the cost of that decision is rarely acknowledged.",
        "Commuting costs money. Living closer to the office costs money. Childcare schedules become harder to manage. Time spent traveling is time that cannot be recovered. In most cases, salaries do not change to reflect any of this. The added burden falls almost entirely on the individual.",
        "This is where return to office policies quietly become something else.",
        "They start acting as a way to reduce headcount without announcing layoffs. When people leave because they cannot afford the commute, cannot reorganize their lives again, or simply cannot make it work anymore, it gets labeled as personal choice or attrition. On paper, no one was laid off. In reality, the effect is the same.",
        "Over time, this leads to fewer companies offering real flexibility. Not because remote work does not work, but because eventually every company faces cost pressure. When that happens, flexibility becomes one of the easiest things to remove.",
        "From an individual point of view, this is worrying. We already live in a system where everything costs more than it did before. Flexibility was not a luxury. It was a way to absorb those costs and keep some balance. Taking it away means asking people to carry even more weight, often without any compensation or acknowledgment.",
        "Return to office is not a neutral decision. It is not just about collaboration or company culture. It directly affects finances, time, energy, and the ability to plan a life that does not feel constantly under pressure.",
        "That is why, for individuals, the return to office is bad news."
    ]
}
